app/controllers/blogs_controller.rb

  def create
    @blog = Blog.new(blog_params)
    @blog.save
---
INSERT INTO "blogs" ("title", "category", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "2"], ["category", "music"], ["body", "test2"], ["created_at", "2022-01-21 11:44:34.256672"], ["updated_at", "2022-01-21 11:44:34.256672"]]

  def update
    blog = Blog.find(params[:id])
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]